# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArrArray..::..ReverseIterator Method
ModelCurveArrArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ModelCurveArrArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ModelCurveArrArrayIterator
```

Visual C++
---
```text
public:
virtual ModelCurveArrArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace